from sklearn.naive_bayes import GaussianNB   #import Gaussian Bayes modeling function
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score

In [178]:
import pandas as pd
import numpy as np

In [179]:
assessments_loc = "datasets/assessments.csv"
assessments = pd.read_csv(assessments_loc)

student_assess_loc = "datasets/studentAssessment.csv"
student_assess = pd.read_csv(student_assess_loc)

student_info_loc = "datasets/studentInfo.csv"
student_info = pd.read_csv(student_info_loc)

student_reg_loc = "datasets/studentRegistration.csv"
student_reg = pd.read_csv(student_reg_loc)

student_vle_loc = "datasets/studentVle.csv"
student_vle = pd.read_csv(student_vle_loc)

#vle_loc = "datasets/vle.csv"
#vle = pd.read_csv(vle_loc)

In [180]:
courses_loc = "datasets/courses.csv"
courses = pd.read_csv(courses_loc)

In [181]:
courses.head(5)

  code_module code_presentation  module_presentation_length
0         AAA             2013J                         268
1         AAA             2014J                         269
2         BBB             2013J                         268
3         BBB             2014J                         262
4         BBB             2013B                         240

In [182]:
courses2 = courses.copy()
courses2.code_presentation = courses2.code_presentation.apply(lambda x: x if 'J' in x else "")
courses2['code_presentation'].replace('', np.nan, inplace=True)
courses2.dropna(subset=['code_presentation'], inplace=True)
courses2.head(5)

  code_module code_presentation  module_presentation_length
0         AAA             2013J                         268
1         AAA             2014J                         269
2         BBB             2013J                         268
3         BBB             2014J                         262
6         CCC             2014J                         269

In [183]:
removal_list = ['CCC','EEE','GGG']

courses3 = courses2.copy()
courses3.code_module = courses3.code_module.apply(lambda x: x if x not in removal_list else "")
courses3['code_module'].replace('', np.nan, inplace=True)
courses3.dropna(subset=['code_module'], inplace=True)
courses3.head(5)

  code_module code_presentation  module_presentation_length
0         AAA             2013J                         268
1         AAA             2014J                         269
2         BBB             2013J                         268
3         BBB             2014J                         262
8         DDD             2013J                         261

In [184]:
#print(assessments.shape)
#assessments.head()

In [185]:
#assessments.dtypes

In [186]:
#assessments.count()

In [187]:
#print(courses.shape)
#courses.head()

In [188]:
#courses.dtypes

In [189]:
#courses.count()

In [190]:
#print(student_assess.shape)
#student_assess.head()

In [191]:
#student_assess.dtypes

In [192]:
#student_assess.count()

In [193]:
#print(student_info.shape)
#student_info.head()

In [194]:
#student_info.dtypes

In [195]:
#student_info.count()

# using student_reg1 from now on ;)

In [196]:
#print(student_reg.shape)
#student_reg.head()
student_reg1 = student_reg.copy()
student_reg1 = student_reg1.drop("date_unregistration", axis=1)
student_reg1.head()

  code_module code_presentation  id_student  date_registration
0         AAA             2013J       11391             -159.0
1         AAA             2013J       28400              -53.0
2         AAA             2013J       30268              -92.0
3         AAA             2013J       31604              -52.0
4         AAA             2013J       32885             -176.0

# merge studentAssess & assess in order to drop post-first assessments

In [197]:
df_assess_merge_1 = pd.merge(student_assess, assessments, on="id_assessment")
df_assess_merge_1.sort_values("id_student")
df_assess_merge_1.head(10)

,id_assessment,id_student,date_submitted,is_banked,score,code_module,code_presentation,assessment_type,date,weight
0,1752,11391,18,0,78.0,AAA,2013J,TMA,19.0,10.0
1,1752,28400,22,0,70.0,AAA,2013J,TMA,19.0,10.0
2,1752,31604,17,0,72.0,AAA,2013J,TMA,19.0,10.0
3,1752,32885,26,0,69.0,AAA,2013J,TMA,19.0,10.0
4,1752,38053,19,0,79.0,AAA,2013J,TMA,19.0,10.0
5,1752,45462,20,0,70.0,AAA,2013J,TMA,19.0,10.0
6,1752,45642,18,0,72.0,AAA,2013J,TMA,19.0,10.0
7,1752,52130,19,0,72.0,AAA,2013J,TMA,19.0,10.0
8,1752,53025,9,0,71.0,AAA,2013J,TMA,19.0,10.0
9,1752,57506,18,0,68.0,AAA,2013J,TMA,19.0,10.0

In [198]:
df_assess_merge_1.id_student.value_counts()[:5]

537811     28
554881     26
632074     25
543010     24
2697921    24
Name: id_student, dtype: int64

In [199]:
df = df_assess_merge_1.copy()
df['id_course'] = df['code_module'] + "-" + df['code_presentation']
df = df.drop(['code_module','code_presentation'],axis=1) # 'score','is_banked','weight','date'
df = df.sort_values("id_student")
df.head(10)[:7]

,id_assessment,id_student,date_submitted,is_banked,score,assessment_type,date,weight,id_course
2685,1761,6516,164,0,61.0,TMA,166.0,20.0,AAA-2014J
2376,1760,6516,116,0,63.0,TMA,117.0,20.0,AAA-2014J
1756,1758,6516,17,0,60.0,TMA,19.0,10.0,AAA-2014J
2871,1762,6516,210,0,77.0,TMA,215.0,30.0,AAA-2014J
1970,1759,6516,51,0,48.0,TMA,54.0,20.0,AAA-2014J
88494,25362,8462,-1,1,93.0,TMA,20.0,5.0,DDD-2014J
90368,25363,8462,-1,1,83.0,TMA,41.0,10.0,DDD-2014J

In [200]:
#sel9 = df[df['id_student']==555786]
#sel9

In [201]:
#sel7 = df[df['id_student']==477812]
#sel7

In [202]:
# student 6516 only took 1 course, therefore, there should only be 1 assessment left for them, of a value of 17
df2 = df.copy()
df2 = df2.groupby(by='id_student')
df2 = df2.apply(lambda g: g[g['date_submitted'] == g['date_submitted'].min()])
df2.head(10)[:7]

                  id_assessment  id_student  date_submitted  is_banked  score  \
id_student
6516       1756            1758        6516              17          0   60.0
8462       88494          25362        8462              -1          1   93.0
           90368          25363        8462              -1          1   83.0
           90712          25364        8462              -1          1   83.0
           92364          25365        8462              -1          1   87.0
11391      0               1752       11391              18          0   78.0
23629      3285           14984       23629               9          0   67.0

                 assessment_type   date  weight  id_course
id_student
6516       1756              TMA   19.0    10.0  AAA-2014J
8462       88494             TMA   20.0     5.0  DDD-2014J
           90368             TMA   41.0    10.0  DDD-2014J
           90712             TMA   62.0    10.0  DDD-2014J
           92364             TMA  111.0    25.0  DDD-2014J
11391      0                 TMA   19.0    10.0  AAA-2013J
23629      3285              TMA   19.0     5.0  BBB-2013B

# Confirm that student of id 537811 and 477812 only have 2 (or close to 2) 'first assessments' (1 per module & presentation)

In [203]:
df2.id_student.value_counts()
sel6 = df2[df2['id_student']==477812]
sel6

                   id_assessment  id_student  date_submitted  is_banked  \
id_student
477812     133368          34886      477812              -1          1
           138653          34892      477812              -1          1
           141182          34896      477812              -1          1
           136157          34889      477812              -1          1
           136382          34890      477812              -1          1
           140951          34895      477812              -1          1
           134819          34888      477812              -1          1
           139763          34894      477812              -1          1
           133706          34887      477812              -1          1
           137228          34891      477812              -1          1
           142002          34897      477812              -1          1
           138910          34893      477812              -1          1

                   score assessment_type   date  weight  id_course
id_student
477812     133368   90.0             TMA   24.0    12.5  FFF-2014B
           138653   94.0             CMA  227.0     0.0  FFF-2014B
           141182   92.0             CMA  227.0     0.0  FFF-2014B
           136157   89.0             TMA  129.0    25.0  FFF-2014B
           136382   84.0             TMA  171.0    25.0  FFF-2014B
           140951   95.0             CMA  227.0     0.0  FFF-2014B
           134819   87.0             TMA   87.0    25.0  FFF-2014B
           139763   76.0             CMA  227.0     0.0  FFF-2014B
           133706   86.0             TMA   52.0    12.5  FFF-2014B
           137228   93.0             CMA  227.0     0.0  FFF-2014B
           142002   87.0             CMA  227.0     0.0  FFF-2014B
           138910   81.0             CMA  227.0     0.0  FFF-2014B

In [204]:
df2 = df2.drop_duplicates(['id_student','id_course'])

In [205]:
sel8 = df2[df2['id_student']==555786]
sel8

                   id_assessment  id_student  date_submitted  is_banked  \
id_student
555786     117907          34873      555786              18          0
           105169          34860      555786              18          0

                   score assessment_type  date  weight  id_course
id_student
555786     117907   72.0             TMA  19.0    12.5  FFF-2013J
           105169   92.0             TMA  19.0    12.5  FFF-2013B

In [206]:
#df2.id_student.value_counts()
df2.shape

(23436, 9)

# Ready to start phase 2: clean each dataframe
- check that dtypes are appropriate
- check for dups
- check null/NaN/missing values in rows/columns

# Phase 3: merge all dataframes

# Phase 4: export single dataframe (that was cleaned & merged)

In [ ]:
#selection = df_assess_merge_1[df_assess_merge_1['id_student']==537811]
#selection2 = selection.head(15)[5:]
#selection2
#sel3 = selection2.groupby(by='code_module')
#sel3 = sel3.apply(lambda g: g[g['date_submitted'] == g['date_submitted'].min()])
#sel3.head(15)

In [ ]:
#grouped = df_assess_merge_1.groupby(['id_student','code_module'])
#sel4['date_submitted'] = sel4[sel4['date_submitted'].min()]

In [ ]:
#grouped = grouped.filter(lambda x: x['date_submitted'] == x['date_submitted'].min())

In [ ]:
#sel4.head(5)
#sel4.id_student.value_counts()

In [ ]:
#groups = df_assess_merge_1.groupby(by=['id_student'])
#groups = groups.apply(lambda g: g[g['date_submitted'] == g['date_submitted'].min()])

In [ ]:
#groups.head(10)

In [ ]:
#student_reg.dtypes

In [ ]:
#print(student_vle.shape)
#student_vle.head()

In [ ]:
#student_vle.count()

In [ ]:
#student_vle.dtypes

In [ ]:
#print(vle.shape)
#vle.head()

In [ ]:
#vle.dtypes

In [ ]:
#vle.count()

In [ ]:
df_student2 = pd.merge(student_info, student_assess, on = "id_student")

In [ ]:
df_student2.head()

In [ ]:
student_reg = student_reg.drop(['code_module','code_presentation'], axis=1)
student_vle = student_vle.drop(['date'],axis=1)

In [ ]:
df_student = pd.merge(student_vle, student_reg, on="id_student")

In [ ]:
df_student.head()

In [ ]:
vle = vle.drop(['code_module','code_presentation'], axis=1)

In [ ]:
df_student3 = pd.merge(df_student, vle, on="id_site")

In [ ]:
df_student3.head()

In [ ]:
assessments = assessments.drop(['code_module','code_presentation'], axis=1)

In [ ]:
pd.set_option('display.max_columns', None)  
pd.set_option('display.expand_frame_repr', False)
pd.set_option('max_colwidth', -1)

In [ ]:
df_student4 = pd.merge(df_student2, assessments, on = "id_assessment")

In [ ]:
df_student4.head()

In [ ]:
df_student4.columns.values

In [ ]:
df_student3 = df_student3.drop(['code_module','code_presentation'],axis=1)
df_student3.columns.values

In [ ]:
#df_Final = pd.merge(df_student4, df_student3, on="id_student")

In [ ]:
#df_Final.head()

In [ ]:
#df_Final.dtypes

In [ ]:
#total missing values
#df_Final.isnull().sum()

In [ ]:
#only dataframe with non-null year column values
df_Final = df_Final.loc[df_Final['Date'].notnull()]

#change year column into a string
#need to use string type for getYear function below
df_Final['Date'] = df_Final['Date'].astype(str)